const config_cookie = {
    current_lang: "th",
    autorun: true,
    autoclear_cookies: true,
    languages: {
      en: {
        consent_modal: {
          title: "นโยบายคุกกี้",
          description:
            'นโยบายการใช้ Cookie คุณสามารถเลือกปฏิเสธการทำงานของคุ้กกี้ได้ตามความต้องการของคุณ โดยการตั้งค่าเบราว์เซอร์หรือการตั้งค่าความเป็นส่วนตัวของคุณ เพื่อระงับการเก็บรวมรวบข้อมูลโดยคุกกี้ในอนาคต อย่างไรก็ตาม หากคุณตั้งค่าเบราว์เซอร์ หรือค่าความเป็นส่วนตัวของคุณ ด้วยการปฎิเสธการทำงานของคุกกี้ทั้งหมด คุณอาจไม่สามารถใช้งานฟังก์ชั่นบางอย่าง หรือทั้งหมดบนเว็บไซต์ได้อย่างมีประสิทธิภาพ กดปุ่ม "ยอมรับทั้งหมด" เพื่ออนุญาตให้เราสามารถนำข้อมูลการใช้งานไปวิเคราะห์เพื่อพัฒนาเว็บไซต์ต่อไป นโยบายคุกกี้ <button type="button" data-cc="c-settings" class="cc-link">การตั้งค่าคุกกี้</button>',
          primary_btn: {
            text: "ยอมรับทั้งหมด",
            role: "accept_all", // 'accept_selected' or 'accept_all'
          },
          secondary_btn: {
            text: "ปฏิเสธทั้งหมด",
            role: "accept_necessary", // 'settings' or 'accept_necessary'
          },
        },
        settings_modal: {
          title: "การตั้งค่าคุกกี้",
          save_settings_btn: "บันทึกการตั้งค่า",
          accept_all_btn: "ยอมรับทั้งหมด",
          reject_all_btn: "ปฏิเสธทั้งหมด",
          close_btn_label: "Close",
          cookie_table_headers: [
            { col1: "Name" },
            { col2: "Domain" },
            { col3: "Expiration" },
            { col4: "Description" },
          ],
          blocks: [
            {
              title: "ประกาศความเป็นส่วนตัว",
              description:
                'คุกกี้คือไฟล์ข้อความขนาดเล็กซึ่งถูกคัดลอกลงในฮาร์ดดิสก์ของคุณโดยเว็บไซต์ คุกกี้ไม่ทำให้คอมพิวเตอร์ของคุณเสียหายและไม่มีไวรัสใดๆ ทั้งสิ้น คุกกี้จากเว็บไซต์ของเราจะไม่เก็บรวบรวมข้อมูลส่วนตัวของคุณ คุณสามารถปิดการใช้งานคุกกี้ได้ตลอดเวลาผ่านการตั้งค่าในบราวเซอร์ของคุณ ทั้งนี้เพื่อใช้สำหรับวัตถุประสงค์ที่ไม่เป็นที่เปิดเผย การประเมินผลทางสถิติ และเพื่อการปรับปรุงความง่ายและสะดวกต่อการใช้งานสำหรับผู้ใช้ต่อไป <a href="#" class="cc-link"></a>.',
            },
            {
              title: "คุกกี้ที่จำเป็น",
              description:
                "คุกกี้พื้นฐานที่จำเป็น เพื่อช่วยให้การทำงานหลักของเว็บไซต์ใช้งานได้ รวมถึงการเข้าถึงพื้นที่ที่ปลอดภัยต่าง ๆ ของเว็บไซต์ หากไม่มีคุกกี้นี้เว็บไซต์จะไม่สามารถทำงานได้อย่างเหมาะสม และจะใช้งานได้โดยการตั้งค่าเริ่มต้น โดยไม่สามารถปิดการใช้งานได้",
              toggle: {
                value: "necessary",
                enabled: true,
                readonly: true, // cookie categories with readonly=true are all treated as "necessary cookies"
              },
            },
            {
              title: "คุกกี้เพื่อการวิเคราะห์",
              description:
                "คุกกี้ในส่วนวิเคราะห์ จะช่วยให้เว็บไซต์เข้าใจรูปแบบการใช้งานของผู้เข้าชมและจะช่วยปรับปรุงประสบการณ์การใช้งาน โดยการเก็บรวบรวมข้อมูลและรายงานผลการใช้งานของผู้ใช้งาน",
              toggle: {
                value: "analytics", // your cookie category
                enabled: false,
                readonly: false,
              },
             },
            {
             },
          ],
        },
      },
    },
  };
  

let cc = initCookieConsent();
cc.run(config_cookie);
